<a href="https://colab.research.google.com/github/kh408623-art/1MIS2800/blob/main/Hamparian_HW3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [3]:
# Type this code exactly as shown to intall the first library needed for
!pip install --upgrade pandas ipython-sql prettytable==3.10.1

/bin/bash: line 1: pip install --upgrade pandas ipython-sql prettytable==3.10.1: command not found

In [4]:
# Install the SQL extension. Remember to type exactly as shown here.
!pip install ipython-sql
print("ipython sql installed")

/bin/bash: line 1: pip install ipython-sql: command not found
ipython sql installed

In [5]:
# Load the SQL magic extension
%load_ext sql

In [6]:
#this code imports sqlite3 and prints a statement stating it has been imported
import sqlite3
print("sqlite imported")

sqlite imported

In [7]:
# This creates a brand-new, empty database file named 'AdCampaigns2026.db'
conn = sqlite3.connect('AdCampaigns2026.db')
print("database created")

database created

In [8]:
# This line is required so Colab stops acting like Python and acts more
%sql sqlite:///AdCampaigns2026.db

In [9]:
#Block 1
#Instructions: Find and fix the error.

%%sql
CREATE TABLe Marketing_Brands (
  brand_id INTEGER PRIMARY KEY,
  brand_name TEXT,
  BRAND_TYPE TEXT,
  BRAND_BUDGET INTEGER
) STRICT;

 * sqlite:///AdCampaigns2026.db
(sqlite3.OperationalError) table Marketing_Brands already exists
[SQL: CREATE TABLe Marketing_Brands (
  brand_id INTEGER PRIMARY KEY,
  brand_name TEXT,
  BRAND_TYPE TEXT,
  BRAND_BUDGET INTEGER
) STRICT;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [10]:
#Block 2
# Instructions: Find and fix the error.

%%sql
INSERT INTO Marketing_Brands (brand_id, brand_name, brand_type, brand_budget)
VALUES
  (1, 'Doritos', 'Snacks', 7000000),
  (2, 'AWS', 'Technology', 15000000),
  (3, 'Pepsi', 'Beverages', 2000000),
  (4, 'He_Gets_us', 'Religous', 1000000),
  (5, 'Dr_Pepper', 'Beverages', 5000000),
  (6, 'IBM', 'Technology', 100000),
  (7,'Google', 'Technology',8000000);

 * sqlite:///AdCampaigns2026.db
(sqlite3.IntegrityError) UNIQUE constraint failed: Marketing_Brands.brand_id
[SQL: INSERT INTO Marketing_Brands (brand_id, brand_name, brand_type, brand_budget)
VALUES
  (1, 'Doritos', 'Snacks', 7000000),
  (2, 'AWS', 'Technology', 15000000),
  (3, 'Pepsi', 'Beverages', 2000000),
  (4, 'He_Gets_us', 'Religous', 1000000),
  (5, 'Dr_Pepper', 'Beverages', 5000000),
  (6, 'IBM', 'Technology', 100000),
  (7,'Google', 'Technology',8000000);]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [11]:
#Block 3
%%sql
-- Instructions: Fix the code to select all the columns from the marketing brands table
Select * From Marketing_Brands;

 * sqlite:///AdCampaigns2026.db
Done.

[(1, 'Doritos', 'Snacks', 7000000),
 (2, 'AWS', 'Technology', 15000000),
 (3, 'Pepsi', 'Beverages', 2000000),
 (4, 'He_Gets_us', 'Religous', 1000000),
 (5, 'Dr_Pepper', 'Beverages', 5000000),
 (6, 'IBM', 'Technology', 100000),
 (7, 'Google', 'Technology', 8000000)]

In [15]:
#Block 4
%%sql
--Instructions: Fix the code to display only the brand names and brand types that had budget over 700000
Select * from Marketing_Brands where brand_budget > 700000;

 * sqlite:///AdCampaigns2026.db
Done.

[(1, 'Doritos', 'Snacks', 7000000),
 (2, 'AWS', 'Technology', 15000000),
 (3, 'Pepsi', 'Beverages', 2000000),
 (4, 'He_Gets_us', 'Religous', 1000000),
 (5, 'Dr_Pepper', 'Beverages', 5000000),
 (7, 'Google', 'Technology', 8000000)]

In [16]:
#Block 5
%%sql
--Instructions: fix the code to find brand types that are Religious
Select * From Marketing_Brands where brand_type = 'Religous';

 * sqlite:///AdCampaigns2026.db
Done.

[(4, 'He_Gets_us', 'Religous', 1000000)]

In [17]:
#Block 6
%%sql
--Instructions: Fix the code to display the brand names that have a budget under 1000000
SELECT * FROM Marketing_Brands where brand_budget < 1000000;

 * sqlite:///AdCampaigns2026.db
Done.

[(6, 'IBM', 'Technology', 100000)]

In [19]:
#Block 7
%%sql
--Instructions: Fix the code so that this will run SQLite3 in Colab without having to wrap in Python. Hint: It's Magic
SELECT * FROM Marketing_Brands where brand_budget > 7000000

 * sqlite:///AdCampaigns2026.db
Done.

[(2, 'AWS', 'Technology', 15000000), (7, 'Google', 'Technology', 8000000)]

In [23]:
#Block 8

%%sql
--Instructions: Find the brands where the brand type is Snacks or beverages. Display only the brand names
SELECT brand_name
FROM Marketing_brands
where brand_type = 'Snacks' or brand_type = 'Beverages';

 * sqlite:///AdCampaigns2026.db
Done.

[('Doritos',), ('Pepsi',), ('Dr_Pepper',)]

In [24]:
#Block 9
%%sql
--Instructions: Sort the table by brand budget in DESC order. Display only the brand_name and brand_budget.
SELECT brand_name, brand_budget
FROM Marketing_brands
ORDER BY brand_budget DESC;

 * sqlite:///AdCampaigns2026.db
Done.

[('AWS', 15000000),
 ('Google', 8000000),
 ('Doritos', 7000000),
 ('Dr_Pepper', 5000000),
 ('Pepsi', 2000000),
 ('He_Gets_us', 1000000),
 ('IBM', 100000)]

In [25]:
#Block 10
#using SQLite3 (and all its magic) to create a table showing all the columns in ascending order by budget.
%%sql
SELECT *
FROM Marketing_brands
order by brand_budget asc;

 * sqlite:///AdCampaigns2026.db
Done.

[(6, 'IBM', 'Technology', 100000),
 (4, 'He_Gets_us', 'Religous', 1000000),
 (3, 'Pepsi', 'Beverages', 2000000),
 (5, 'Dr_Pepper', 'Beverages', 5000000),
 (1, 'Doritos', 'Snacks', 7000000),
 (7, 'Google', 'Technology', 8000000),
 (2, 'AWS', 'Technology', 15000000)]

1. missing the word TABLE
2. missing the word INTO
3. missing the *
4. needed more information to get the outcome needed.
5. needed more information to get the outcome needed.
6. needed more information to get the outcome needed.
7. missing the %%sql
8. needed more information to get the outcome needed.
9. needed more information to get the outcome needed.
10. same as 9